; Входные данные:
; 1. Число n — количество строк.
; 2. n строк (произвольный текст).
; 3. Число k — количество поисковых запросов.
; 4. k строк — поисковые запросы.

; Выходные данные:
; Все строки из списка, в которых одновременно встречаются все поисковые запросы (без учёта регистра).

; Примечания:
; - Регистр символов НЕ важен.
; - Порядок запросов в строке НЕ важен.
; - Запросы могут быть частью слов (например, "python" найдёт "python3").

lst = []
q = int(input())
for _ in range(q):
    lst.append(input())

w = int(input())
quer = []
for _ in range(w):
    quer.append(input().lower())

for s in lst:
    s_low = s.lower()
    all_found = True
    for q in quer:
        if q.lower() not in s_low:
            all_found = False
            break
    if all_found:
        print(s)

# если элемента нет, меняем флаг и переходим к следущему этапу цикла 